Revit 2024 API
ExternalServices.BuiltInExternalServices.HoleDefinitionService Property
 The external service to view and modify hole definition parameters.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId HoleDefinitionService { get; }
Visual Basic
Public Shared ReadOnly Property HoleDefinitionService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ HoleDefinitionService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace